---
type: CategoryNameMap
namespace: Autodesk.Revit.DB
version: 2024
members: 11
tags: [revit-api, class]
---

# CategoryNameMap

`Autodesk.Revit.DB.CategoryNameMap` · Revit 2024 · 11 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | CategoryNameMap | — | `public CategoryNameMap ()` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | Contains | — | `public virtual bool Contains ( string key )` |
| Method | Erase | — | `public virtual int Erase ( string key )` |
| Method | ForwardIterator | — | `public virtual CategoryNameMapIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual bool Insert ( string key , Category item )` |
| Method | ReverseIterator | — | `public virtual CategoryNameMapIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual Category this [ string key ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |